{
  "id": "structure-oral-cavity",
  "type": "structure",
  "name": "Oral Cavity",
  "alternateNames": ["Mouth", "Buccal cavity", "Cavitas oris"],
  "fmaId": "FMA:20292",

  "levels": {
    "1": {
      "level": 1,
      "summary": "The mouth is where digestion begins - it's where you chew food and mix it with saliva.",
      "explanation": "Your mouth is the starting point of your digestive system. When you eat, your teeth break food into smaller pieces (like a food processor), while your tongue moves food around and helps you swallow. Special glands in your mouth make saliva (spit) that makes food wet and easier to swallow. Saliva also starts breaking down some foods, especially starches like bread and pasta.",
      "keyTerms": [
        { "term": "saliva", "definition": "The watery liquid in your mouth that helps break down food" },
        { "term": "chewing", "definition": "Using your teeth to break food into smaller pieces" },
        { "term": "tongue", "definition": "The muscle in your mouth that moves food around and helps you taste" }
      ],
      "analogies": ["Your mouth is like a food processor - it breaks big pieces into small pieces and adds liquid to make a smooth mixture."],
      "examples": ["When you chew bread, you might notice it starts to taste sweeter - that's because enzymes in your saliva are breaking down starches into sugars."]
    },
    "2": {
      "level": 2,
      "summary": "The oral cavity contains teeth for mechanical digestion, the tongue for manipulation and taste, and salivary glands that produce saliva containing digestive enzymes.",
      "explanation": "The oral cavity is bounded by the lips anteriorly, cheeks laterally, hard and soft palate superiorly, and the floor of the mouth inferiorly. There are 32 permanent teeth in adults arranged in incisors, canines, premolars, and molars. Three pairs of major salivary glands (parotid, submandibular, sublingual) produce approximately 1-1.5 liters of saliva daily. The tongue is a muscular organ covered with papillae containing taste buds.",
      "keyTerms": [
        { "term": "palate", "definition": "The roof of the mouth, divided into hard (bony) and soft (muscular) portions", "pronunciation": "PAL-it" },
        { "term": "papillae", "definition": "Small bumps on the tongue surface, some containing taste buds", "pronunciation": "pah-PILL-ee" },
        { "term": "salivary glands", "definition": "Glands that produce saliva; includes parotid, submandibular, and sublingual" }
      ],
      "analogies": ["The three pairs of salivary glands work like sprinklers in a garden, continuously moistening the mouth."]
    },
    "3": {
      "level": 3,
      "summary": "The oral cavity initiates mechanical and chemical digestion through mastication and salivary secretion, with saliva containing amylase for starch hydrolysis and lingual lipase for lipid digestion.",
      "explanation": "The oral cavity proper is separated from the vestibule (space between teeth/gums and cheeks/lips) by the dental arches. Mastication involves the masseter, temporalis, medial and lateral pterygoid muscles innervated by the mandibular division of the trigeminal nerve (V3). Saliva is 99.5% water with electrolytes (Na+, K+, Cl-, HCO3-), mucins (lubrication), salivary amylase (ptyalin) for starch digestion, lingual lipase (initiates triglyceride hydrolysis), lysozyme (antimicrobial), and IgA. Salivation is primarily controlled by the parasympathetic nervous system via facial (VII) and glossopharyngeal (IX) nerves.",
      "keyTerms": [
        { "term": "mastication", "definition": "The process of chewing food using the teeth and jaw muscles", "pronunciation": "mas-tih-KAY-shun" },
        { "term": "salivary amylase", "definition": "Enzyme (ptyalin) that breaks down starch into maltose and dextrins; optimal pH 6.8" },
        { "term": "vestibule", "definition": "The space between the teeth/gums and the cheeks/lips" }
      ],
      "clinicalNotes": "Xerostomia (dry mouth) from Sjogren syndrome, radiation, or medications increases caries risk and impairs swallowing."
    },
    "4": {
      "level": 4,
      "summary": "The oral cavity integrates neuromuscular control of mastication, complex salivary gland physiology with autonomic regulation, and the initiation of both oral and pharyngeal phases of deglutition.",
      "explanation": "Mastication is a complex motor pattern generated by the trigeminal motor nucleus with modulation from the cerebral cortex, cerebellum, and brainstem pattern generators. Salivary secretion involves a two-stage model: acinar cells produce isotonic primary secretion rich in amylase (serous) or mucins (mucous), while ductal cells modify this by reabsorbing Na+ and Cl- and secreting K+ and HCO3-, producing hypotonic saliva. Parasympathetic stimulation (ACh acting on M3 receptors) increases watery secretion; sympathetic stimulation (norepinephrine on beta-adrenergic receptors) produces viscous, protein-rich saliva. The tongue contains intrinsic muscles (alter shape) and extrinsic muscles (genioglossus, hyoglossus, styloglossus, palatoglossus) for positioning, innervated by CN XII except palatoglossus (vagus via pharyngeal plexus). Taste transduction involves Type II cells (sweet, bitter, umami via GPCR-coupled PLCbeta2) and Type III cells (sour via PKD2L1 and salt via ENaC).",
      "keyTerms": [
        { "term": "acinar cells", "definition": "Secretory cells in salivary glands that produce the primary secretion containing enzymes and mucins" },
        { "term": "ductal modification", "definition": "Process by which salivary duct cells alter the ionic composition of primary secretion to produce hypotonic saliva" },
        { "term": "deglutition", "definition": "The process of swallowing, involving oral, pharyngeal, and esophageal phases", "pronunciation": "dee-gloo-TISH-un" }
      ],
      "clinicalNotes": "Sialolithiasis most commonly affects the submandibular gland due to the longer, upward course of Wharton's duct and more mucous secretion. Frey syndrome (gustatory sweating) results from aberrant parasympathetic reinnervation after parotid surgery."
    },
    "5": {
      "level": 5,
      "summary": "Clinical assessment of oral pathology requires integration of salivary gland imaging, histopathologic classification of lesions, understanding of oral manifestations of systemic disease, and management of oral cancer and precancerous conditions.",
      "explanation": "Salivary gland tumors are classified by WHO criteria: benign (pleomorphic adenoma most common overall, Warthin tumor in elderly males) and malignant (mucoepidermoid carcinoma most common malignant). Rule of 80s: 80% in parotid, 80% of parotid tumors benign, 80% of parotid tumors are pleomorphic adenoma. Minor salivary gland tumors more likely malignant. Oral squamous cell carcinoma (OSCC) risk factors include tobacco, alcohol (synergistic), betel quid, and HPV (oropharynx). Leukoplakia biopsy indicated if homogeneous white patch persists >2 weeks; erythroplakia has highest malignant potential. Oral manifestations of systemic disease: oral hairy leukoplakia (EBV, immunosuppression), Kaposi sarcoma (HHV-8, AIDS), oral candidiasis (immunocompromise, diabetes), strawberry tongue (scarlet fever, Kawasaki), geographic tongue (benign migratory glossitis). Salivary gland imaging: ultrasound for superficial lesions, MRI for deep lobe parotid, sialography for ductal pathology, FNA for tumor characterization.",
      "keyTerms": [
        { "term": "pleomorphic adenoma", "definition": "Most common salivary gland tumor; benign mixed tumor with epithelial and mesenchymal elements; recurrence if inadequately excised" },
        { "term": "mucoepidermoid carcinoma", "definition": "Most common malignant salivary gland tumor; graded low-intermediate-high based on cystic component and mitoses" },
        { "term": "leukoplakia", "definition": "White patch that cannot be characterized clinically or pathologically as any other disease; biopsy to rule out dysplasia/carcinoma" }
      ],
      "clinicalNotes": "OSCC staging uses TNM. Treatment typically wide local excision with neck dissection for node-positive disease, followed by radiation +/- chemotherapy for advanced stages. 5-year survival varies by stage and site (lip best, tongue base worst)."
    }
  },

  "media": [
    {
      "id": "oral-cavity-3d",
      "type": "3d-model",
      "filename": "oral_cavity.glb",
      "title": "3D Oral Cavity Model",
      "description": "Interactive 3D model showing teeth, tongue, salivary glands, and palate"
    }
  ],
  "citations": [
    {
      "id": "openstax-ap-ch23-1",
      "type": "textbook",
      "title": "The Digestive System",
      "source": "OpenStax Anatomy and Physiology 2e",
      "chapter": "23.3",
      "url": "https://openstax.org/books/anatomy-and-physiology-2e/pages/23-3-the-mouth-pharynx-and-esophagus",
      "license": "CC BY 4.0"
    },
    {
      "id": "netter-plate-45",
      "type": "textbook",
      "title": "Atlas of Human Anatomy",
      "authors": ["Frank H. Netter"],
      "source": "Elsevier",
      "page": "45-52"
    }
  ],
  "crossReferences": [
    { "targetId": "system-digestive", "targetType": "system", "relationship": "parent", "label": "Digestive System" },
    { "targetId": "structure-esophagus", "targetType": "structure", "relationship": "sibling", "label": "Esophagus" },
    { "targetId": "structure-teeth", "targetType": "structure", "relationship": "child", "label": "Teeth" },
    { "targetId": "structure-tongue", "targetType": "structure", "relationship": "child", "label": "Tongue" },
    { "targetId": "structure-salivary-glands", "targetType": "structure", "relationship": "child", "label": "Salivary Glands" }
  ],
  "tags": {
    "systems": ["digestive"],
    "structures": ["FMA:20292"],
    "topics": ["anatomy", "physiology"],
    "clinicalRelevance": "high",
    "examRelevance": { "usmle": true, "shelf": ["surgery"] }
  },
  "createdAt": "2026-01-24T00:00:00.000Z",
  "updatedAt": "2026-01-24T00:00:00.000Z",
  "version": 1,
  "status": "published"
}
